fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_Договоры</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВКМ_СоздатьРеализацииЗаМесяц(Период) Экспорт

	Результат = Новый Структура("Создано, Ошибки, Строки", 0, Новый Массив, Новый Массив);

	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Результат.Ошибки.Добавить(НСтр("ru = 'Не указан период.'"));
		Возврат Результат;
	КонецЕсли;

	ОбработкаОбъект = Создать();
	ТаблицаДоговоров = ОбработкаОбъект.ВКМ_ЗаполнитьСписокДоговоров(Период);

	Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
		ОписаниеСтроки = Новый Структура("ВКМ_Договор, ВКМ_Контрагент, ВКМ_Реализация, ВКМ_Статус");
		ЗаполнитьЗначенияСвойств(ОписаниеСтроки, СтрокаДоговора);

		Если ЗначениеЗаполнено(СтрокаДоговора.ВКМ_Реализация) Тогда
			Результат.Строки.Добавить(ОписаниеСтроки);
			Продолжить;
		КонецЕсли;

		Попытка
			РеализацияОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			РеализацияОбъект.Дата = КонецМесяца(Период);
			РеализацияОбъект.Договор = СтрокаДоговора.ВКМ_Договор;
			РеализацияОбъект.Контрагент = СтрокаДоговора.ВКМ_Контрагент;
			РеализацияОбъект.Организация = СтрокаДоговора.ВКМ_Договор.Организация;
			РеализацияОбъект.Ответственный = Пользователи.ТекущийПользователь();
			РеализацияОбъект.ВыполнитьАвтозаполнение();

			Если РеализацияОбъект.Услуги.Количество() = 0 Тогда
				ОписаниеСтроки.ВКМ_Статус = НСтр("ru = 'Нет услуг для выставления'");
				Результат.Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Договор %1: автозаполнение не дало услуг, документ не проведён.'"),
					СтрокаДоговора.ВКМ_Договор));
				Результат.Строки.Добавить(ОписаниеСтроки);
				Продолжить;
			КонецЕсли;

			Если НЕ РеализацияОбъект.ПроверитьЗаполнение() Тогда
				ОписаниеСтроки.ВКМ_Статус = НСтр("ru = 'Ошибка проверки заполнения'");
				Результат.Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Договор %1: проверка заполнения не пройдена.'"),
					СтрокаДоговора.ВКМ_Договор));
				Результат.Строки.Добавить(ОписаниеСтроки);
				Продолжить;
			КонецЕсли;

			РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ОписаниеСтроки.ВКМ_Реализация = РеализацияОбъект.Ссылка;
			ОписаниеСтроки.ВКМ_Статус = НСтр("ru = 'Акт создан'");
			Результат.Создано = Результат.Создано + 1;
		Исключение
			ОписаниеСтроки.ВКМ_Статус = НСтр("ru = 'Ошибка создания'");
			Результат.Ошибки.Добавить(СтрШаблон(
				НСтр("ru = 'Договор %1: %2'"),
				СтрокаДоговора.ВКМ_Договор,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецПопытки;

		Результат.Строки.Добавить(ОписаниеСтроки);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
